# Feb 12 note (apply, iterrows)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('grades.csv')
df.head()

        name  q1  q2  q3  t1  t2  final
0       amit   4   2   5  87  23     59
1  bearegard   3   4   2  78  34     67
2     cecily   3   5   3  34  40     65
3    deshaun   5   5   5  40  39     69
4  esmeralda   4   3   4  37  34     55

In [3]:
df['final'].apply(lambda x : 'A' if x > 60 else 'B')

0    B
1    A
2    A
3    A
4    B
Name: final, dtype: object

In [5]:
df['grade'] = df['final'].apply(lambda x : 'A' if x > 60 else 'B')
df

        name  q1  q2  q3  t1  t2  final grade
0       amit   4   2   5  87  23     59     B
1  bearegard   3   4   2  78  34     67     A
2     cecily   3   5   3  34  40     65     A
3    deshaun   5   5   5  40  39     69     A
4  esmeralda   4   3   4  37  34     55     B

In [6]:
def something(a, b): 
    return a + b - 3

In [8]:
something(5, 432)

434

In [10]:
df.apply(lambda x : something(x['q1'], x['q2']), axis=1)

0    3
1    4
2    5
3    7
4    4
dtype: int64

In [12]:
for idx, row in df.iterrows():
    print("Index: " + str(idx) + "    Row: " + str(row))

Index: 0    Row: name     amit
q1          4
q2          2
q3          5
t1         87
t2         23
final      59
grade       B
Name: 0, dtype: object
Index: 1    Row: name     bearegard
q1               3
q2               4
q3               2
t1              78
t2              34
final           67
grade            A
Name: 1, dtype: object
Index: 2    Row: name     cecily
q1            3
q2            5
q3            3
t1           34
t2           40
final        65
grade         A
Name: 2, dtype: object
Index: 3    Row: name     deshaun
q1             5
q2             5
q3             5
t1            40
t2            39
final         69
grade          A
Name: 3, dtype: object
Index: 4    Row: name     esmeralda
q1               4
q2               3
q3               4
t1              37
t2              34
final           55
grade            B
Name: 4, dtype: object

In [13]:
df.loc[idx, 'q3'] = 34
df

        name  q1  q2  q3  t1  t2  final grade
0       amit   4   2   5  87  23     59     B
1  bearegard   3   4   2  78  34     67     A
2     cecily   3   5   3  34  40     65     A
3    deshaun   5   5   5  40  39     69     A
4  esmeralda   4   3  34  37  34     55     B

In [14]:
whos

Variable    Type         Data/Info
----------------------------------
df          DataFrame            name  q1  q2  q3 <...>  34  37  34     55     B
idx         int          4
np          module       <module 'numpy' from '/op<...>kages/numpy/__init__.py'>
pd          module       <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
row         Series       name     esmeralda\nq1   <...>B\nName: 4, dtype: object
something   function     <function something at 0x11a0fd200>

In [15]:
row['q1'] * row['q2']

12

In [16]:
def foo(a):
    return a + a

In [17]:
# You can also use function with apply
df['q1'].apply(foo)

0     8
1     6
2     6
3    10
4     8
Name: q1, dtype: int64